#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Скрипт автоматического удаления майнера и восстановления безопасности
После инцидента 08.11.2025
"""

import sys
from server_ssh import ServerSSH

def print_section(title: str):
    """Красивый заголовок секции"""
    print("\n" + "="*70)
    print(f"  {title}")
    print("="*70 + "\n")

def kill_miner(ssh: ServerSSH):
    """Остановить процесс майнера"""
    print_section("1. ОСТАНОВКА МАЙНЕРА")
    
    # Найти PID майнера
    output, _, _ = ssh.execute("ps aux | grep 'systemd-bench' | grep -v grep | awk '{print $2}'")
    pids = [pid.strip() for pid in output.split('\n') if pid.strip()]
    
    if pids:
        for pid in pids:
            print(f"  Убиваем процесс PID {pid}...")
            ssh.execute(f"kill -9 {pid}")
        print(f"  [OK] Убито процессов: {len(pids)}")
    else:
        print("  [OK] Процессы майнера не найдены")
    
    # Проверка
    output, _, _ = ssh.execute("ps aux | grep 'systemd-bench' | grep -v grep")
    if output.strip():
        print("  [!] ВНИМАНИЕ: Процессы всё ещё работают!")
        print(output)
    else:
        print("  [OK] Все процессы остановлены")

def remove_miner_files(ssh: ServerSSH):
    """Удалить файлы майнера"""
    print_section("2. УДАЛЕНИЕ ФАЙЛОВ МАЙНЕРА")
    
    paths_to_remove = [
        "/.system/",
        "/root/.system-cache/",
        "/run/.bench.pid",
        "/var/run/.bench.pid"
    ]
    
    for path in paths_to_remove:
        print(f"  Удаляем {path}...")
        ssh.execute(f"rm -rf {path}")
    
    print("\n  [OK] Файлы удалены")
    
    # Проверка
    print("\n  Проверка:")
    for path in paths_to_remove:
        output, _, exit_code = ssh.execute(f"ls {path} 2>/dev/null")
        if exit_code == 0:
            print(f"    [!] {path} всё ещё существует!")
        else:
            print(f"    [OK] {path} удален")

def remove_cron_job(ssh: ServerSSH):
    """Удалить вредоносные cron jobs"""
    print_section("3. УДАЛЕНИЕ CRON JOBS")
    
    # Получить текущий crontab
    output, _, _ = ssh.execute("crontab -l 2>/dev/null")
    
    if 'install_bench' in output or 'bench.pid' in output:
        print("  Найден вредоносный cron job. Удаляем...")
        
        # Удалить строки с install_bench
        ssh.execute("crontab -l 2>/dev/null | grep -v 'install_bench' | crontab -")
        
        print("  [OK] Cron job удален")
    else:
        print("  [OK] Вредоносные cron jobs не найдены")
    
    # Проверка
    output, _, _ = ssh.execute("crontab -l 2>/dev/null")
    if output.strip():
        print("\n  Оставшиеся cron jobs:")
        print(output)
    else:
        print("\n  [OK] Crontab пуст")

def remove_ssh_key(ssh: ServerSSH):
    """Удалить вредоносный SSH ключ"""
    print_section("4. УДАЛЕНИЕ SSH КЛЮЧА")
    
    malicious_key = "sanya221b@gmail.com"
    
    # Получить текущие ключи
    output, _, _ = ssh.execute("cat ~/.ssh/authorized_keys")
    
    if malicious_key in output:
        print(f"  Найден вредоносный ключ: {malicious_key}")
        print("  Удаляем...")
        
        # Удалить строку с вредоносным ключом
        ssh.execute(f"grep -v '{malicious_key}' ~/.ssh/authorized_keys > ~/.ssh/authorized_keys.tmp")
        ssh.execute("mv ~/.ssh/authorized_keys.tmp ~/.ssh/authorized_keys")
        ssh.execute("chmod 600 ~/.ssh/authorized_keys")
        
        print("  [OK] Ключ удален")
    else:
        print("  [OK] Вредоносный ключ не найден")
    
    # Проверка
    output, _, _ = ssh.execute("cat ~/.ssh/authorized_keys")
    print("\n  Текущие SSH ключи:")
    for line in output.split('\n'):
        if line.strip():
            parts = line.strip().split()
            if len(parts) >= 3:
                print(f"    - {parts[0]} ... {parts[2]}")

def install_fail2ban(ssh: ServerSSH):
    """Установить и настроить fail2ban"""
    print_section("5. УСТАНОВКА FAIL2BAN")
    
    # Проверить установлен ли
    output, _, exit_code = ssh.execute("which fail2ban-server")
    
    if exit_code != 0:
        print("  fail2ban не установлен. Устанавливаем...")
        ssh.execute("apt-get update -qq")
        ssh.execute("DEBIAN_FRONTEND=noninteractive apt-get install -y fail2ban")
    else:
        print("  [OK] fail2ban уже установлен")
    
    # Создать конфигурацию
    print("\n  Настраиваем fail2ban...")
    config = """[DEFAULT]
bantime = 3600
findtime = 600
maxretry = 3

[sshd]
enabled = true
port = 22
logpath = /var/log/auth.log
maxretry = 3
"""
    
    ssh.execute(f"cat > /etc/fail2ban/jail.local << 'EOF'\n{config}\nEOF")
    
    # Запустить
    print("  Запускаем fail2ban...")
    ssh.execute("systemctl enable fail2ban")
    ssh.execute("systemctl restart fail2ban")
    
    # Проверка
    output, _, _ = ssh.execute("systemctl status fail2ban --no-pager")
    if 'Active: active' in output:
        print("  [OK] fail2ban работает")
    else:
        print("  [!] ОШИБКА: fail2ban не запустился")

def verify_cleanup(ssh: ServerSSH):
    """Финальная проверка"""
    print_section("6. ФИНАЛЬНАЯ ПРОВЕРКА")
    
    # Проверить процессы
    print("  Проверка процессов майнера:")
    output, _, _ = ssh.execute("ps aux | grep -iE 'bench|mine|xmr' | grep -v grep")
    if output.strip():
        print("    [!] НАЙДЕНЫ ПОДОЗРИТЕЛЬНЫЕ ПРОЦЕССЫ:")
        print(output)
    else:
        print("    [OK] Подозрительные процессы не найдены")
    
    # Проверить load average
    print("\n  Load Average:")
    output, _, _ = ssh.execute("uptime")
    print(f"    {output.strip()}")
    
    # Проверить память
    print("\n  Использование памяти:")
    output, _, _ = ssh.execute("free -h")
    print(output)
    
    # Проверить Docker
    print("\n  Docker контейнеры:")
    output, _, _ = ssh.execute("docker ps --format 'table {{.Names}}\t{{.Status}}'")
    print(output)

def main():
    """Основная функция"""
    print("\n" + "="*70)
    print("     АВТОМАТИЧЕСКАЯ ОЧИСТКА СЕРВЕРА geodrive-n8n")
    print("              После инцидента 08.11.2025")
    print("="*70 + "\n")
    
    ssh = ServerSSH()
    
    try:
        if not ssh.connect():
            print("[!] Не удалось подключиться к серверу!")
            sys.exit(1)
        
        # Выполняем очистку
        kill_miner(ssh)
        remove_miner_files(ssh)
        remove_cron_job(ssh)
        remove_ssh_key(ssh)
        install_fail2ban(ssh)
        verify_cleanup(ssh)
        
        print("\n" + "="*70)
        print("  ОЧИСТКА ЗАВЕРШЕНА")
        print("="*70)
        print("\nРекомендации:")
        print("  1. Сменить root пароль (новый пароль уже установлен)")
        print("  2. Проверить Hetzner аккаунт (2FA, API токены)")
        print("  3. Ротация всех API ключей (OpenAI, Telegram, DB)")
        print("  4. Мониторинг load average следующие 24 часа")
        print("  5. Проверить логи: tail -f /var/log/auth.log")
        
    except Exception as e:
        print(f"\n[!] Ошибка: {e}")
        sys.exit(1)
    finally:
        ssh.close()
    
    print("\n[OK] Скрипт завершен успешно.")

if __name__ == "__main__":
    main()

